app/views/dashboard/index.html.erb

Welcome to your personal dashboard <%= User.find(session[:user_id]) %>!
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1