app/controllers/admin/companies_controller.rb

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
---
  def new
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:fund_id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 3 AND (`companies`.fund_id = 1) ORDER BY name LIMIT 1
---
  def show
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:fund_id])
    @company = @fund.companies.find(params[:id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
INSERT INTO `companies` (`fund_id`, `name`, `founded`, `industry_id`, `description`, `reserves`, `syndicate`, `status_id`, `status_date`, `exit_amount`, `fund_return`, `notes`, `active`, `created_at`, `updated_at`) VALUES (1, 'CradlePoint', '2006-01-01', 1, '', NULL, '', 1, NULL, 0.0, 0.0, '', 0, '2011-05-13 04:41:50', '2011-05-13 04:41:50')
---
  def create
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:fund_id])
    @company = @fund.companies.build(params[:company])

    if @company.save

SELECT `funds`.* FROM `funds` WHERE (`funds`.organization_id = 1)
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
---
  def index
    if session[:fund_id].present?
      @fund = Fund.find(session[:fund_id])
      @organization = @fund.organization
      @companies = @fund.companies
    else
      @organization = Organization.find(session[:organization_id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 5 AND (`companies`.fund_id = 1) ORDER BY name LIMIT 1
---
  def edit
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:fund_id])
    @company = @fund.companies.find(params[:id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 5 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 5 AND (`companies`.fund_id = 1) ORDER BY name LIMIT 1
UPDATE `companies` SET `description` = 'Alliance creates dynamic social networks around chronic illnesses.', `updated_at` = '2011-08-06 21:22:33' WHERE `companies`.`id` = 3
---
  def update
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:fund_id])
    @company = @fund.companies.find(params[:id])

    if @company.update_attributes(params[:company])