app/controllers/admin/forecasts_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 4 LIMIT 1
---
  def index
    @company = Company.find(params[:company_id])