app/controllers/admin/funds_controller.rb

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
---
  def new
    @links = {"Fund List" => admin_organization_funds_path}
    @organization = Organization.find(params[:organization_id])

SELECT `funds`.* FROM `funds` WHERE (`funds`.organization_id = 1)
---
  def show
    @fund = Fund.find(params[:id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
INSERT INTO `funds` (`name`, `number`, `aggregate`, `size`, `management_fee`, `start_date`, `active`, `created_at`, `updated_at`, `organization_id`) VALUES ('Pretend', '', 0, 0.0, 0.0, '2011-08-06', 0, '2011-08-06 17:59:42', '2011-08-06 17:59:42', NULL)
---
  def create
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.build(params[:fund])

    if @fund.save

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
---
  def index
    @organization = Organization.find(params[:organization_id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
---
  def edit
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:id])

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 AND (`funds`.organization_id = 1) LIMIT 1
UPDATE `funds` SET `name` = 'Fund 1', `updated_at` = '2011-08-06 22:45:54' WHERE `funds`.`id` = 1
---
  def update
    @organization = Organization.find(params[:organization_id])
    @fund = @organization.funds.find(params[:id])

    if @fund.update_attributes(params[:fund])