app/controllers/admin/operationals_controller.rb

  def index
    @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 4 LIMIT 1