app/controllers/admin/organizations_controller.rb

SELECT `organizations`.* FROM `organizations`
---
  def index
    @organizations = Organization.all

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
SELECT `funds`.* FROM `funds` WHERE (`funds`.organization_id = 1) ORDER BY start_date DESC
---
  def show
    @organization = Organization.find(params[:id])
    session[:organization_id] = @organization.id
    reset_fund_session
    @funds = @organization.funds.order('start_date ASC')

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1
---
  def edit
    @organization = Organization.find(params[:id])