app/controllers/admin/period_results_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
SELECT `user_defined_categories`.* FROM `user_defined_categories` WHERE (`user_defined_categories`.company_id = 2)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new
    @links = {'Company Edit' => edit_admin_company_path(params[:company_id])}
    @period_result = PeriodResult.new
    @company = Company.find(params[:company_id])
    @revenue, @cogs, @operating_exp, @other = [],[],[],[]
    @company.user_defined_categories.each do |c|

SELECT `period_results`.* FROM `period_results` WHERE `period_results`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `custom_cells`.* FROM `custom_cells` WHERE (`custom_cells`.period_result_id = 1)
SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 LIMIT 1
---
  def edit
    @period_result = PeriodResult.find(params[:id])
    @company = Company.find(params[:company_id])
    @links = {'Company Edit' => edit_admin_company_path(@period_result.company)}
    @breadcrumb_trail = "#{@period_result.company.fund} > #{@period_result.company} > Editing Financial period #{@period_result}"
    @company.user_defined_categories.each do |c|
      @revenue = @period_result.custom_cells.where('user_defined_categories.c_type' => 1).includes('user_defined_category')