app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @links = {'Add User' => new_admin_user_path}
    @users = User.all

SELECT `funds`.* FROM `funds`
---
  def new
    # if there are no funds we need to let them know to set up
    # a fund before adding users
    if Fund.all.size > 0

INSERT INTO `users` (`company_id`, `email`, `first_name`, `last_name`, `password_hash`, `fund_id`, `role_id`, `active`, `is_admin`, `last_login`, `password_recovery_hash`, `recovery_hash_created_at`, `created_at`, `updated_at`) VALUES (NULL, 'derek@gmail.com', 'Derek', 'Keller', '$2a$10$.ojNUjjzTWmP1VaFqz4nS.guMnoBvnHfTP4F0h4eOBCLDXS/0KoV6', 1, 1, 1, 0, NULL, NULL, NULL, '2011-05-17 00:39:09', '2011-05-17 00:39:09')
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def edit
    @links = {'User List' => admin_users_path}
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit_profile
    @links = {'User List' => admin_users_path}
    @user = User.find(params[:user_id])