app/views/companies/index.html.erb

SELECT `series`.* FROM `series` WHERE (`series`.company_id = 4) ORDER BY date desc LIMIT 1
---
			<td class="right">
				<%= ph(company.series.first.try(:fully_diluted_ownership)) %>

SELECT `period_results`.* FROM `period_results` WHERE (`period_results`.company_id = 3) LIMIT 1
---
			<td class="right">
				<%= nh(company.period_results.first.try(:gross_margin)) %>