app/views/period_results/_percentage_table.html.erb

	<tr class="<%= cycle('even','odd') %>">
		<% @company.user_defined_categories.where(:c_type => 1).each do |udc| %>
---
SELECT `user_defined_categories`.* FROM `user_defined_categories` WHERE `user_defined_categories`.`c_type` = 1 AND (`user_defined_categories`.company_id = 4)