app/views/admin/organizations/index.html.erb

		<td><%= link_to organization.name, admin_organization_path(organization) %></td>
		<td><%= organization.funds.count %></td>
		<td><%= organization.companies.count %></td>
---
SELECT COUNT(*) FROM `funds` WHERE (`funds`.organization_id = 1)
SELECT `funds`.* FROM `funds` WHERE (`funds`.organization_id = 1)
SELECT COUNT(*) FROM `companies` INNER JOIN `funds` ON `companies`.fund_id = `funds`.id WHERE ((`funds`.organization_id = 1))
SELECT `companies`.* FROM `companies`