app/views/admin/organizations/show.html.erb

SELECT COUNT(*) FROM `companies` WHERE (`companies`.fund_id = 1)
SELECT `companies`.* FROM `companies` INNER JOIN `funds` ON `companies`.fund_id = `funds`.id WHERE ((`funds`.organization_id = 1))
---
		<td><%= link_to "Fund #{fund.number}", admin_organization_fund_path(@organization, fund) %></td>
		<td class="center"><%= fund.companies.size %></td>