app/views/admin/funds/edit.html.erb

SELECT COUNT(*) FROM `companies` WHERE (`companies`.fund_id = 1)
SELECT `companies`.* FROM `companies` WHERE (`companies`.fund_id = 1) ORDER BY name
---
			Total Companies:
			<%= @fund.companies.size %>