app/views/admin/funds/show.html.erb

	</tr>
	<% @fund.companies.each do |company| %>
---
SELECT `companies`.* FROM `companies` INNER JOIN `funds` ON `companies`.fund_id = `funds`.id WHERE ((`funds`.organization_id = 1))