app/controllers/auth_controller.rb

  def set_password_recovery_hash
    @user = User.find_by_email(params[:email])

    if @user
      #Set the recovery hash, mark the time, email a link to reset the password
      @user.password_recovery_hash = Digest::SHA1.hexdigest( @user.created_at.to_s + Time.now.to_s )
      @user.recovery_hash_created_at = Time.now
      @user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'derek@highway12ventures.com' LIMIT 1
UPDATE `users` SET `last_login` = '2011-04-30 01:04:39', `updated_at` = '2011-04-30 01:04:39' WHERE `users`.`id` = 1