app/controllers/companies_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 2 LIMIT 1
---
  def show
    @company = Company.find(params[:id])