app/controllers/period_results_controller.rb

  def index
    @view_by = get_view_by()
    @view_type = get_view_type()

    @company = Company.find(params[:company_id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1