app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def edit_profile
    @links = {'User List' => users_path}
    @user = User.find(params[:user_id])