app/views/admin/users/_form.html.erb

SELECT `funds`.* FROM `funds`
---
	  <%= form.label :fund_id %><br />
	  <%= form.select :fund_id, Fund.options_for_select, :include_blank => true %>